Джира/src/Documents/Центр_Задача/Центр_Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Центр_Задача</name>
  <comment>Задачи сотрудников</comment>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.Центр_ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Центр_Партнеры</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Центр_Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавнаяЗадача</name>
    <type>
      <types>DocumentRef.Центр_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Метки</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>CatalogRef.Центр_МеткиЗадач</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Джира/src/InformationRegisters/Центр_ДедлайнЗадач/Центр_ДедлайнЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Центр_ДедлайнЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Согласовант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Дедлайн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КомментарийОтказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПереноса</name>
    <type>
      <types>CatalogRef.Центр_ПричинаПереносаДедлайна</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Центр_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Джира/src/InformationRegisters/Центр_ОценкаЧасов/Центр_ОценкаЧасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Центр_ОценкаЧасов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>От</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>До</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Согласовант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОценки</name>
    <type>
      <types>EnumRef.Центр_ТипОценкиЧасов</types>
    </type>
  </resources>
  <attributes>
    <name>КомментарийОтказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Центр_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Джира/src/Documents/Центр_Задача/Forms/ФормаСозданияСогласованияДедлайна/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.Задача) Тогда
		Задача = Параметры.Задача;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Центр_ДедлайнЗадачСрезПоследних.Задача,
		|	Центр_ДедлайнЗадачСрезПоследних.Согласовано,
		|	Центр_ДедлайнЗадачСрезПоследних.КомментарийОтказа,
		|	Центр_ДедлайнЗадачСрезПоследних.Отказ
		|ПОМЕСТИТЬ вт_Перенос
		|ИЗ
		|	РегистрСведений.Центр_ДедлайнЗадач.СрезПоследних(, Задача = &Задача) КАК Центр_ДедлайнЗадачСрезПоследних
		|ГДЕ
		|	Центр_ДедлайнЗадачСрезПоследних.Согласовант = &Согласовант
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Центр_ОценкаЧасовСрезПоследних.Длительность,
		|	Центр_ОценкаЧасовСрезПоследних.Задача
		|ПОМЕСТИТЬ вт_Длительность
		|ИЗ
		|	РегистрСведений.Центр_ОценкаЧасов.СрезПоследних(, Задача = &Задача) КАК Центр_ОценкаЧасовСрезПоследних
		|ГДЕ
		|	Центр_ОценкаЧасовСрезПоследних.Согласовано
		|	И Центр_ОценкаЧасовСрезПоследних.Согласовант = &Согласовант
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Центр_ДедлайнЗадач.Задача,
		|	КОЛИЧЕСТВО(Центр_ДедлайнЗадач.КомментарийОценки) КАК Количество
		|ПОМЕСТИТЬ вт_СогласованоПоЗадаче
		|ИЗ
		|	РегистрСведений.Центр_ДедлайнЗадач КАК Центр_ДедлайнЗадач
		|ГДЕ
		|	Центр_ДедлайнЗадач.Задача = &Задача
		|	И Центр_ДедлайнЗадач.Согласовано
		|СГРУППИРОВАТЬ ПО
		|	Центр_ДедлайнЗадач.Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Длительность.Длительность,
		|	ЕСТЬNULL(вт_Перенос.Согласовано, ЛОЖЬ) КАК Согласовано,
		|	вт_Перенос.КомментарийОтказа,
		|	ЕСТЬNULL(вт_Перенос.Отказ, ЛОЖЬ) КАК Отказ,
		|	ЕСтьNull(вт_СогласованоПоЗадаче.Количество,0) КАК Количество
		|ИЗ
		|	вт_Длительность КАК вт_Длительность
		|		ПОЛНОЕ СОЕДИНЕНИЕ вт_Перенос КАК вт_Перенос
		|		ПО вт_Перенос.Задача = вт_Длительность.Задача
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СогласованоПоЗадаче КАК вт_СогласованоПоЗадаче
		|		ПО вт_Длительность.Задача = вт_СогласованоПоЗадаче.Задача";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.УстановитьПараметр("Согласовант", Пользователи.АвторизованныйПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Элементы.ПричинаПереноса.Видимость = Ложь;
	Если Выборка.Следующий() Тогда
		Если Выборка.Отказ Тогда
			КомментарийОтказа = Выборка.КомментарийОтказа;
		КонецЕсли;
		Если Выборка.Количество > 0 Тогда
			Элементы.Длительность.Видимость = Ложь;
			Элементы.ДатаСтарта.Видимость = Ложь;
			Элементы.ПричинаПереноса.Видимость = Истина;
			ПереносДедлайна = Истина;
		КонецЕсли;
		Длительность = Выборка.Длительность;
	КонецЕсли;
	ДатаСтарта = ТекущаяДатаСеанса();
	ЧислоСекВДне = 86400;
	Дедлайн = ДатаСтарта + (Длительность * ЧислоСекВДне);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ДатаСтартаПриИзменении(Элемент)
	ЧислоСекВДне = 86400;
	Дедлайн = ДатаСтарта + (Длительность * ЧислоСекВДне);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Отменить(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)
	ОтправитьНаСогласованиеНаСервере();
	Закрыть();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтправитьНаСогласованиеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Центр_Задача.Постановщик,
		|	Центр_Задача.Постановщик ССЫЛКА Справочник.Центр_Партнеры КАК ЭтоПартнер,
		|	Центр_Задача.ГлавныйМенеджер
		|ИЗ
		|	Документ.Центр_Задача КАК Центр_Задача
		|ГДЕ
		|	Центр_Задача.Ссылка = &Задача";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Согласующий = Неопределено;
	Если Выборка.Следующий() Тогда
		Если Выборка.ЭтоПартнер Тогда
			Согласующий = Выборка.ГлавныйМенеджер;
		Иначе
			Согласующий = Выборка.Постановщик;
		КонецЕсли;
	КонецЕсли;
	Если ПереносДедлайна Тогда
		РегистрыСведений.Центр_ДедлайнЗадач.СоздатьЗаписьСогласования(Задача, Согласующий, Дедлайн, КомментарийОценки,
			ПричинаПереноса);
	Иначе
		РегистрыСведений.Центр_ДедлайнЗадач.СоздатьЗаписьСогласования(Задача, Согласующий, Дедлайн, КомментарийОценки);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
